{
  "Ce este un array in programare?": "Un array este o structura de date care poate stoca multiple valori de acelasi tip intr-o singura variabila.",
  "Cum functioneaza o bucla for?": "O bucla for este folosita pentru a repeta un bloc de cod de un anumit numar de ori.",
  "Ce este o functie in programare?": "O functie este un bloc de cod care poate fi reutilizat pentru a realiza o anumita sarcina.",
  "Care este diferenta dintre let si var in JavaScript?": "'let' are bloc de scope, in timp ce 'var' are functia ca scope.",
  "Ce este recursivitatea?": "Recursivitatea este tehnica de a face o functie sa se apeleze pe ea insasi.",
  "Ce este un obiect in programare?": "Un obiect este o colectie de perechi cheie-valoare care reprezinta atribute si comportamente.",
  "Cum se face debug in cod?": "Debugging-ul implica folosirea de unelte pentru a detecta si corecta erorile in cod.",
  "Ce este o clasa in programare?": "O clasa este un tip de blueprint care defineste proprietatile si metodele unui obiect.",
  "Ce este encapsularea?": "Encapsularea este principiul programarii orientate pe obiecte care ascunde detaliile implementarii unui obiect.",
  "Ce este un API?": "Un API este o interfata care permite comunicarea intre diferite aplicatii software.",
  "Cum functioneaza un callback in JavaScript?": "Un callback este o functie trecuta ca argument intr-o alta functie pentru a fi executata mai tarziu.",
  "Ce este TypeScript?": "TypeScript este un superset al JavaScript care adauga suport pentru tipuri statice.",
  "Ce este un algoritm?": "Un algoritm este o serie de pasi logici folositi pentru a rezolva o problema.",
  "Cum se utilizeaza promisiunile in JavaScript?": "Promisiunile sunt folosite pentru a gestiona operatiuni asincrone, permitand un cod mai curat si mai usor de citit.",
  "Ce este o expresie lambda?": "O expresie lambda este o functie anonima definita inline.",
  "Ce este programarea asincrona?": "Programarea asincrona permite executia de cod fara a bloca firul principal al aplicatiei.",
  "Ce este un test unit?": "Un test unit verifica functionalitatea unei componente individuale din cod.",
  "Cum se gestioneaza erorile in cod?": "Gestionarea erorilor implica folosirea de blocuri try-catch sau alte mecanisme similare pentru a trata exceptiile.",
  "Ce este o interfata in TypeScript?": "O interfata defineste structura unui obiect si este folosita pentru a impune un tip specific.",
  "Ce este React?": "React este o librarie JavaScript pentru construirea de interfete de utilizator.",
  "Cum functioneaza state-ul in React?": "State-ul in React este un obiect care pastreaza datele componentei si poate fi actualizat pentru a reactualiza UI-ul.",
  "Ce este Node.js?": "Node.js este un runtime JavaScript pentru server care permite rularea codului JavaScript in afara unui browser.",
  "Cum se foloseste o baza de date in backend?": "Baza de date este utilizata pentru a stoca si a recupera date pentru aplicatii folosind limbaje precum SQL sau ORM-uri.",
  "Ce este middleware in backend?": "Middleware este un strat de software care intercepteaza cererile HTTP pentru a adauga functionalitati precum autentificarea sau logarea.",
  "Ce este un framework?": "Un framework ofera o structura predefinita pentru dezvoltarea aplicatiilor, reducand timpul de implementare."
}
